kodilla-soap-library/sample/BookRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:kodilla="http://kodilla.com/library/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <kodilla:getBookRequest>
            <kodilla:name>A112</kodilla:name>
        </kodilla:getBookRequest>
    </soapenv:Body>
</soapenv:Envelope>